#include <iostream>
#include <fstream>
#include "BinTree.h"
using namespace std;

int f = 0;

// Добавление элемента в список //////////////////////////////////////////////////////////////////////////////////////////
void push(int a, node** t)
{
	if ((*t) == NULL)
	{
		(*t) = new node;
		(*t)->num = ++f;
		(*t)->weight = a;
		(*t)->left = (*t)->right = NULL;
		return;
	}

	if (a > (*t)->weight) push(a, &(*t)->right);
	else push(a, &(*t)->left);
}
// Подсчет веса списка //////////////////////////////////////////////////////////////////////////////////////////
unsigned int total(node* t)
{
	// проверка не пуст ли груз //////////////////////////////////////////////////////////////////////////////////////////
	if (t == NULL)
		return 0;

	unsigned int r = 0;
	// если есть слева груз считает его //////////////////////////////////////////////////////////////////////////////////////////
	if (t->left)
		r = r + total(t->left);
	// если есть справа груз считает его //////////////////////////////////////////////////////////////////////////////////////////
	if (t->right)
		r = r + total(t->right);
	// считает результат //////////////////////////////////////////////////////////////////////////////////////////
	r = r + t->weight;
	return r;
}
// Вывод строкой //////////////////////////////////////////////////////////////////////////////////////////
void printCor(node* t)
{
	if (t == NULL) return;
	else
	{
		cout << "(";
		cout << t->weight;
		printCor(t->left);
	}
	printCor(t->right);
	cout << ")";
}
// Вывод списком //////////////////////////////////////////////////////////////////////////////////////////
void printTree(node* t, int u)
{
	if (t == NULL) return;
	else
	{
		printTree(t->right, ++u);
		for (int i = 0; i < u - 1; ++i) cout << "\t";
		cout << t->num << "(" << t->weight << ")\n";
		u--;
	}
	printTree(t->left, ++u);
}
// Создание списка в зависимости от выбора файл/консоль //////////////////////////////////////////////////////////////////////////////////////////
void console(node** cor)
{
	int n, s;
	cout << "введите количество элементов  ";
	cin >> n;
	for (int i = 0; i < n; ++i)
	{
		cout << "ведите число  ";
		cin >> s;

		push(s, &(*cor));
	}
}

void file(node** cor)
{
	int n;
	int s;
	ifstream lin("lin.txt");
	lin >> n;

	for (int i = 0; i < n; ++i)
	{
		lin >> s;

		push(s, &(*cor));
	}
	lin.close();
}
///// Удаление /////////////////////////////////////////////////////////////////
void deleteCor(node* cor) 
{
	if (cor != NULL) {
		deleteCor(cor->left);
		deleteCor(cor->right);
		delete cor;
	}
}
//////////////////////////////////////////////////////////////////////////////////////////