#include <iostream>
#include <conio.h>
#include <fstream>
#include "BinTree.h"
using namespace std;

int fnum = 0;

int totalLog(node* cor)
{
	// проверка не пуст ли груз //////////////////////////////////////////////////////////////////////////////////////////
	if (cor == NULL)
		return 0;
	unsigned int r = 0;
	cout << "Запуск функции номер " << ++fnum << " находится в узле " << cor->num << "\n";
	_getch();
	int numf = fnum;
	// если есть слева груз считает его //////////////////////////////////////////////////////////////////////////////////////////
	if (cor->left)
	{
		cout << "Идет в левое плечо\n";
		_getch();
		r = r + totalLog(cor->left);
		cout << "Находится в узле " << cor->num << "\n";
		_getch();
	}
	// если есть справа груз считает его //////////////////////////////////////////////////////////////////////////////////////////
	if (cor->right)
	{
		cout << "Идет в правое плечо\n";
		_getch();
		r = r + totalLog(cor->right);
		cout << "Находится в узле " << cor->num << "\n";
		_getch();
	}
	// считает результат //////////////////////////////////////////////////////////////////////////////////////////
	r = r + cor->weight;
	cout << "Возвращается назад сумма =" << r << "\n";
	_getch();
	cout << "Функция номер " << numf << " завершилась\n";
	_getch();
	return r;
}

int main()
{
	setlocale(LC_ALL, "ru");
	node* cor = NULL;
	// выбор консоли или файла ///////////////////////////////////////////////////////////////
	char k;
	cout << "Ввод в консоль на кнопку С, из файла любая другая\n\n";
	k = _getch();
	switch (k)
	{
	case 'c':
		console(&cor);
		break;
	default:
		file(&cor);
	}
	//////////////////////////////////////////////////////////////////////////////////////////
	// Выбор вывода коромысла ////////////////////////////////////////////////////////////////
	cout << "Вывод строкой на кнопку С, списком на кнопку S, оба варианта на B\n\n";
	k = _getch();
	switch (k)
	{
	// Вывод списком //////////////////////////////////////////////////////////////////////////////////////////
	case 'c':
		printCor(cor);
		cout << endl;
		break;
	// Вывод списком //////////////////////////////////////////////////////////////////////////////////////////
	case 's':
		printTree(cor, 0);
		break;
	// Оба варианта сразу //////////////////////////////////////////////////////////////////////////////////////////
	case 'b':
		printCor(cor);
		cout << endl << endl;
		printTree(cor, 0);
		break;
	default:
		break;
	}
	// Вывод общего веса //////////////////////////////////////////////////////////////////////////////////////////
	cout << "Пошаговое выполнение на кнопу S, обычное на любую другую\n";
	k = _getch();
	int a = 0;
	switch (k)
	{
	case 's':
		a = totalLog(cor);
		cout << "Общий вес всех гирек\t" << a;
		break;
	default:
		cout << "Общий вес всех гирек\t" << total(cor);
		break;
	}
	deleteCor(cor);
	k = _getch();
	return 0;
}